ExampleCases/stackedLiquids/0/rhoE_EM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rhoE_EM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 0;

boundaryField
{	
	upWall
    {
        type            zeroGradient;
    }
    downWall
    {
        type            zeroGradient;
    }
    leftandright
    {
        type            zeroGradient;
    }
    Front
    {
        type            empty;
    }
	Back
    {
        type            empty;
    }
}


// ************************************************************************* //
