ExampleCases/stackedLiquids/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
/*    (-0.5 -0.5 -0.01)
    (0.5 -0.5 -0.01)
    (0.5 0.5 -0.01)
    (-0.5 0.5 -0.01)
    (-0.5 -0.5 0.01)
    (0.5 -0.5 0.01)
    (0.5 0.5 0.01)
    (-0.5 0.5 0.01)
*/
    (-0.05  0 -0.01)
    ( 0.05  0 -0.01)
    ( 0.05  1 -0.01)
    (-0.05  1 -0.01)
    (-0.05  0  0.01)
    ( 0.05  0  0.01)
    ( 0.05  1  0.01)
    (-0.05  1  0.01)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (2 41 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary      
(
	upWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    downWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    leftandright
    {
        type patch;
        faces
        (
            (0 4 7 3)
			(1 5 6 2)
        );
    }
    Front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
	Back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
